title: 'Koneksi ke URL Berbahaya Dikenal: 23.154.80.50'
id: 0edb6db5-8ecf-4abf-9aca-3f6c66766640
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://23.154.80.50/aoxbot.arm6'
references:
- https://urlhaus.abuse.ch/url/23.154.80.50/aoxbot.arm6/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://23.154.80.50/aoxbot.arm6
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
