title: 'Koneksi ke URL Berbahaya Dikenal: 84.201.5.31'
id: f82ce638-ed2b-446d-a6f5-bbb3df49f6c6
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://84.201.5.31/1.sh'
references:
- https://urlhaus.abuse.ch/url/84.201.5.31/1.sh/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://84.201.5.31/1.sh
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
