title: 'Koneksi ke URL Berbahaya Dikenal: 23.132.28.196'
id: 7a5879cc-fa0b-44b7-b3b9-9f3fc1428dac
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://23.132.28.196/main_x86'
references:
- https://urlhaus.abuse.ch/url/23.132.28.196/main_x86/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://23.132.28.196/main_x86
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
