title: 'Koneksi ke URL Berbahaya Dikenal: 196.251.84.55'
id: 1a8bc358-72af-4034-85fd-caa4f5979fa0
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://196.251.84.55/renji/renji.mpsl'
references:
- https://urlhaus.abuse.ch/url/196.251.84.55/renji/renji.mpsl/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://196.251.84.55/renji/renji.mpsl
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
