title: 'Koneksi ke URL Berbahaya Dikenal: 195.248.240.141'
id: 296433f7-1f0c-406e-b1f9-4db6933ffaf0
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://195.248.240.141/hiddenbin/boatnet.arm5'
references:
- https://urlhaus.abuse.ch/url/195.248.240.141/hiddenbin/boatnet.arm5/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://195.248.240.141/hiddenbin/boatnet.arm5
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
