title: 'Koneksi ke URL Berbahaya Dikenal: 147.45.125.103'
id: 9f3c9a54-58e1-4cad-91ab-493a79721238
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://147.45.125.103/d/akido.m68k'
references:
- https://urlhaus.abuse.ch/url/147.45.125.103/d/akido.m68k/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://147.45.125.103/d/akido.m68k
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
