title: 'Koneksi ke URL Berbahaya Dikenal: bitbucket.org'
id: 82e93fe9-06ee-4829-bcb3-2ebecc80f3b1
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: https://bitbucket.org/manhutwork/minerepo2/raw/main/uploads/payload_1757898011_9998.txt'
references:
- https://urlhaus.abuse.ch/url/bitbucket.org/manhutwork/minerepo2/raw/main/uploads/payload_1757898011_9998.txt/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: https://bitbucket.org/manhutwork/minerepo2/raw/main/uploads/payload_1757898011_9998.txt
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
