title: 'Koneksi ke URL Berbahaya Dikenal: ft.imugandas.com'
id: 58990716-21ea-45f7-b813-5725964f2263
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://ft.imugandas.com/zte'
references:
- https://urlhaus.abuse.ch/url/ft.imugandas.com/zte/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://ft.imugandas.com/zte
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
