title: 'Koneksi ke URL Berbahaya Dikenal: us-1.apollohost.xyz'
id: f96f9af0-377f-4071-a486-36d7f3bbdc2d
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://us-1.apollohost.xyz/aoxbot.x86'
references:
- https://urlhaus.abuse.ch/url/us-1.apollohost.xyz/aoxbot.x86/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://us-1.apollohost.xyz/aoxbot.x86
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
