title: 'Koneksi ke URL Berbahaya Dikenal: 87.120.187.143'
id: 565ae952-8aa3-4663-b07d-7f52937a6cc1
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://87.120.187.143/00101010101001/morte.x86_64'
references:
- https://urlhaus.abuse.ch/url/87.120.187.143/00101010101001/morte.x86_64/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://87.120.187.143/00101010101001/morte.x86_64
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
