title: 'Koneksi ke URL Berbahaya Dikenal: 89.144.20.51'
id: 20fc036f-031d-4d0f-8b47-3510463aa24b
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://89.144.20.51/bins/UnHAnaAW.mips'
references:
- https://urlhaus.abuse.ch/url/89.144.20.51/bins/UnHAnaAW.mips/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://89.144.20.51/bins/UnHAnaAW.mips
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
