title: 'Koneksi ke URL Berbahaya Dikenal: 91.80.141.20'
id: 5fd29b32-e528-44f9-a9dc-0a1eccb92871
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://91.80.141.20/sshd'
references:
- https://urlhaus.abuse.ch/url/91.80.141.20/sshd/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://91.80.141.20/sshd
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
