title: 'Koneksi ke URL Berbahaya Dikenal: www.wrxcnc.com'
id: 108f7ab3-b912-4ad9-80a0-ff8379114db7
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://www.wrxcnc.com/renji/renji.x86_64'
references:
- https://urlhaus.abuse.ch/url/www.wrxcnc.com/renji/renji.x86_64/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://www.wrxcnc.com/renji/renji.x86_64
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
