title: 'Koneksi ke URL Berbahaya Dikenal: zantux-plan.duckdns.org'
id: 781cd834-3eb5-43d4-87ed-2bc0c40c3210
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://zantux-plan.duckdns.org/bins/morte.mips'
references:
- https://urlhaus.abuse.ch/url/zantux-plan.duckdns.org/bins/morte.mips/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://zantux-plan.duckdns.org/bins/morte.mips
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
