title: 'Koneksi ke URL Berbahaya Dikenal: stashbin.xyz'
id: c8b9eced-365e-48e2-9218-4722f6f336dc
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: https://stashbin.xyz/raw/sctcrojktq'
references:
- https://urlhaus.abuse.ch/url/stashbin.xyz/raw/sctcrojktq/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: https://stashbin.xyz/raw/sctcrojktq
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
