title: 'Koneksi ke URL Berbahaya Dikenal: zidomasones.com'
id: bea8399c-79c0-4b9b-a522-1902379eb813
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://zidomasones.com/w/Photo.scr'
references:
- https://urlhaus.abuse.ch/url/zidomasones.com/w/Photo.scr/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://zidomasones.com/w/Photo.scr
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
