title: 'Koneksi ke URL Berbahaya Dikenal: in.ditchibuprofen.com'
id: d78b334b-7798-4b64-8e35-a9ada602ab0a
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: https://in.ditchibuprofen.com/2usai04hwq.sh'
references:
- https://urlhaus.abuse.ch/url/in.ditchibuprofen.com/2usai04hwq.sh/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: https://in.ditchibuprofen.com/2usai04hwq.sh
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
