title: 'Koneksi ke URL Berbahaya Dikenal: 178.16.55.189'
id: dcd6a85e-cbb4-4b0b-b009-764a780f7bdb
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://178.16.55.189/files/7453936223/Qs3D6Fk.exe'
references:
- https://urlhaus.abuse.ch/url/178.16.55.189/files/7453936223/Qs3D6Fk.exe/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://178.16.55.189/files/7453936223/Qs3D6Fk.exe
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
