title: 'Koneksi ke URL Berbahaya Dikenal: 92.113.147.23'
id: c657bddd-9279-49f1-b7e5-f8a2df323457
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: http://92.113.147.23/armv4l'
references:
- https://urlhaus.abuse.ch/url/92.113.147.23/armv4l/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: http://92.113.147.23/armv4l
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
