title: 'Koneksi ke URL Berbahaya Dikenal: d.99jn.ru'
id: 582abcf5-e339-46d1-8b6a-b6913d5c5fe5
status: stable
description: 'Aturan ini mendeteksi lalu lintas jaringan ke URL berbahaya yang terdaftar
  di URLhaus. URL: https://d.99jn.ru/20e7qexifu.f4v'
references:
- https://urlhaus.abuse.ch/url/d.99jn.ru/20e7qexifu.f4v/
author: Threat-Rule-Generator
date: '2025-09-26'
logsource:
  category: proxy
  product: zeek
detection:
  selection:
    url.original: https://d.99jn.ru/20e7qexifu.f4v
  condition: selection
falsepositives:
- Sangat jarang terjadi, tetapi bisa jika domain telah bersih dan diambil alih untuk
  tujuan yang sah.
level: high
